"use strict";

// Задача №1
// Що потрапить в консоль?

let someVar = 0; // оголошуємо змінну someVar і присвоюємо їй значення 0
++someVar; // інкремент змінної (збільшуємо змінну на одиницю, отримуємо одиницю)

if (someVar) {  // умовний оператор if (перевіряємо змінну: одиниця повертає true) переходимо в тіло оператора if
	console.log(someVar); // виводимо в консоль значення зінної someVar (1)
}

console.log("----------------");


// Задача №2
/* За допомогою циклу FOR виведіть в консоль 10 рядків:
Пункт №1
Пункт №2
і т.д. */

let row = "Пункт №";

for (let i = 1; i <= 10; ++i) {
	console.log(`${row}${i}`);
}

console.log("----------------");


// Задача №3
/* Що потрапить в консоль ?
	if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
		console.log('000');
	} */

if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	// 40 <= 10 || 15 < 5 && 10 <= "10" || 20 === "20"
	// false || false && true || falfe
	// false || false || false
	// false (з умови отримаємо false - тіло умовного оператора виконано не буде)
	console.log('000');
}

console.log("----------------");


// Задача №4
/* Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
Викличте функцію передаючи різні значення, у тому числі не передаючи зовсім.
Функція не має повертати NaN, Infinite або помилку */

function calcDiv(a, b) {
	let result = a / b;
	if (isNaN(result)) {
		console.log("Веддіть, будь ласка, числа");
	} else if (result == "Infinity") {
		console.log("На нуль ділити не можливо");
	} else {
		console.log(`Результат ділення: ${result}`);
	}
};

calcDiv(125, 4);

console.log("----------------");

// Задача №5
/* Створіть масив даних - 5 елементів, один з яких число 10
Обробіть масив за допомогою методу перебору
Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль */

let someArr = [589, ["Жека", "Коля", "Вася"], 10, "10", "Opportunity"];

someArr.forEach((item) => {
	if (item === 10) {
		console.log(`Знайшов ${item}`);
	}
});